test-aurora_plain.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-09 Thu 21:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Aurora Plain Theme - Test Document</title>
<meta name="author" content="Aurora Explorer" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Orbitron:wght@400;500;600;700;800;900&family=Exo+2:wght@300;400;500;600;700;800&family=Fira+Code:wght@300;400;500&display=swap" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="src/aurora_plain_theme/css/aurora_plain.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Aurora Plain Theme - Test Document</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf5184ae">1. 🌌 Aurora Flowing Lights</a>
<ul>
<li><a href="#orgb182c64">1.1. [ ] Explore the aurora effects&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TODO">TODO</span></span></a></li>
<li><a href="#orgdaf1ace">1.2. [X] Test typography&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TODO">TODO</span></span></a></li>
<li><a href="#orgc2f014a">1.3. [X] Verify minimal design&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TODO">TODO</span></span></a></li>
</ul>
</li>
<li><a href="#orgef4f158">2. 🎨 Aurora Color Palette</a>
<ul>
<li><a href="#org89e94a1">2.1. Cyan Lights**</a></li>
<li><a href="#org84fe6e9">2.2. Purple Aurora**</a></li>
<li><a href="#org97a9a52">2.3. Pink Northern Lights**</a></li>
</ul>
</li>
<li><a href="#org11d0ece">3. 📝 Task Management</a>
<ul>
<li><a href="#orgc0507b0">3.1. <span class="todo TODO">TODO</span> Plan aurora photography trip**</a></li>
<li><a href="#org7588e08">3.2. DOING Configure theme settings**</a></li>
<li><a href="#org2dc2797">3.3. <span class="done DONE">DONE</span> Set up development environment**</a></li>
<li><a href="#org8acebcb">3.4. NEXT Review color contrast ratios**</a></li>
<li><a href="#orge6512ea">3.5. NA Document theme limitations**</a></li>
</ul>
</li>
<li><a href="#orgbee093a">4. 💻 Code Examples</a>
<ul>
<li><a href="#orga5bcb79">4.1. JavaScript Example**</a></li>
<li><a href="#orge6179ff">4.2. Python Example**</a></li>
</ul>
</li>
<li><a href="#orgfcdf102">5. 📊 Data Tables</a></li>
<li><a href="#org70215f9">6. 🎯 Progress Tracking</a>
<ul>
<li><a href="#org4e1a069">6.1. <span class="todo TODO">TODO</span> Aurora Theme Development**</a></li>
<li><a href="#orgf9ace2c">6.2. DOING Test accessibility**</a></li>
</ul>
</li>
<li><a href="#org1ea65de">7. 📅 Timeline</a></li>
<li><a href="#orgf96a572">8. 📋 Notes</a>
<ul>
<li><a href="#orga9610f0">8.1. About the Design**</a></li>
<li><a href="#orgda2539e">8.2. Key Features **</a></li>
<li><a href="#orgb0deda0">8.3. Fonts Used **</a></li>
</ul>
</li>
<li><a href="#org29b5583">9. 🔬 Technical Details</a>
<ul>
<li><a href="#org461a282">9.1. CSS Structure **</a></li>
<li><a href="#orgfd5bd9c">9.2. Animations **</a></li>
<li><a href="#orgbab4a3f">9.3. Performance **</a></li>
</ul>
</li>
<li><a href="#org5bdd8f6">10. 📝 Test Footer</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf5184ae" class="outline-2">
<h2 id="orgf5184ae"><span class="section-number-2">1.</span> 🌌 Aurora Flowing Lights</h2>
<div class="outline-text-2" id="text-1">
<p>
Welcome to the Aurora Plain theme - a minimal, sidebar-free design featuring flowing aurora colors and soft gradients.
</p>
</div>
<div id="outline-container-orgb182c64" class="outline-3">
<h3 id="orgb182c64"><span class="section-number-3">1.1.</span> [ ] Explore the aurora effects&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TODO">TODO</span></span></h3>
<div class="outline-text-3" id="text-1-1">
<p>
DEADLINE: <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-12-25 Wed&gt;</span></span>
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Observe the gradient background animation</li>
<li class="off"><code>[&#xa0;]</code> Notice the aurora text effect on the title</li>
<li class="off"><code>[&#xa0;]</code> Check the soft glow effects on TODO items</li>
<li class="off"><code>[&#xa0;]</code> Review the flowing border on code blocks</li>
</ul>

<blockquote>
<p>
"The aurora dances across the digital sky, painting code in colors of the north."
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgdaf1ace" class="outline-3">
<h3 id="orgdaf1ace"><span class="section-number-3">1.2.</span> [X] Test typography&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TODO">TODO</span></span></h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li class="on"><code>[X]</code> Orbitron headings with gradient text</li>
<li class="on"><code>[X]</code> Exo 2 body font</li>
<li class="on"><code>[X]</code> Fira Code monospace</li>
</ul>
</div>
</div>
<div id="outline-container-orgc2f014a" class="outline-3">
<h3 id="orgc2f014a"><span class="section-number-3">1.3.</span> [X] Verify minimal design&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TODO">TODO</span></span></h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li class="on"><code>[X]</code> No sidebar present</li>
<li class="on"><code>[X]</code> Centered content layout</li>
<li class="on"><code>[X]</code> Clean, spacious design</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgef4f158" class="outline-2">
<h2 id="orgef4f158"><span class="section-number-2">2.</span> 🎨 Aurora Color Palette</h2>
<div class="outline-text-2" id="text-2">
<p>
The aurora aesthetic uses a deep gradient background with flowing accent colors:
</p>
</div>
<div id="outline-container-org89e94a1" class="outline-3">
<h3 id="org89e94a1"><span class="section-number-3">2.1.</span> Cyan Lights**</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Color: #00D4FF</li>
<li>Used for: Links, timestamps, H3 headers, code syntax</li>
</ul>
</div>
</div>
<div id="outline-container-org84fe6e9" class="outline-3">
<h3 id="org84fe6e9"><span class="section-number-3">2.2.</span> Purple Aurora**</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Color: #9D4EDD</li>
<li>Used for: Section headers, keywords, strings in code</li>
</ul>
</div>
</div>
<div id="outline-container-org97a9a52" class="outline-3">
<h3 id="org97a9a52"><span class="section-number-3">2.3.</span> Pink Northern Lights**</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Color: #FF006E</li>
<li>Used for: Active tasks, quotes, block borders</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org11d0ece" class="outline-2">
<h2 id="org11d0ece"><span class="section-number-2">3.</span> 📝 Task Management</h2>
<div class="outline-text-2" id="text-3">
<p>
This section demonstrates how TODO items appear with aurora styling:
</p>
</div>
<div id="outline-container-orgc0507b0" class="outline-3">
<h3 id="orgc0507b0"><span class="section-number-3">3.1.</span> <span class="todo TODO">TODO</span> Plan aurora photography trip**</h3>
<div class="outline-text-3" id="text-3-1">
<p>
DEADLINE: <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-12-30 Mon&gt;</span></span>
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Research best locations</li>
<li class="off"><code>[&#xa0;]</code> Check weather forecasts</li>
<li class="off"><code>[&#xa0;]</code> Prepare camera equipment</li>
<li class="off"><code>[&#xa0;]</code> Plan travel logistics</li>
</ul>
</div>
</div>
<div id="outline-container-org7588e08" class="outline-3">
<h3 id="org7588e08"><span class="section-number-3">3.2.</span> DOING Configure theme settings**</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The purple glow animation pulses on active tasks.
</p>
</div>
</div>
<div id="outline-container-org2dc2797" class="outline-3">
<h3 id="org2dc2797"><span class="section-number-3">3.3.</span> <span class="done DONE">DONE</span> Set up development environment**</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Completed with cyan styling.
</p>
</div>
</div>
<div id="outline-container-org8acebcb" class="outline-3">
<h3 id="org8acebcb"><span class="section-number-3">3.4.</span> NEXT Review color contrast ratios**</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Ensuring WCAG AA compliance.
</p>
</div>
</div>
<div id="outline-container-orge6512ea" class="outline-3">
<h3 id="orge6512ea"><span class="section-number-3">3.5.</span> NA Document theme limitations**</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Not currently in scope.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbee093a" class="outline-2">
<h2 id="orgbee093a"><span class="section-number-2">4.</span> 💻 Code Examples</h2>
<div class="outline-text-2" id="text-4">
<p>
Code blocks feature aurora-colored syntax highlighting with flowing top borders.
</p>
</div>
<div id="outline-container-orga5bcb79" class="outline-3">
<h3 id="orga5bcb79"><span class="section-number-3">4.1.</span> JavaScript Example**</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-javascript">// Aurora gradient configuration
const auroraColors = {
  deep: '#0F0C29',
  mid: '#302B63',
  light: '#24243E',
  cyan: '#00D4FF',
  purple: '#9D4EDD',
  pink: '#FF006E'
};

function createAuroraGradient(element) {
  const gradient = `linear-gradient(135deg, 
    ${auroraColors.deep} 0%, 
    ${auroraColors.mid} 40%, 
    ${auroraColors.light} 80%)`;

  element.style.background = gradient;
  element.style.backgroundSize = '400% 400%';
  element.style.animation = 'aurora-flow 15s ease infinite';
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orge6179ff" class="outline-3">
<h3 id="orge6179ff"><span class="section-number-3">4.2.</span> Python Example**</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-python">"""
Aurora Plain Theme - CSS Configuration
Minimal design with flowing lights aesthetic
"""

from dataclasses import dataclass
from typing import List

@dataclass
class AuroraPalette:
    """Aurora color palette"""
    background_deep: str = "#0F0C29"
    background_mid: str = "#302B63"
    background_light: str = "#24243E"
    cyan: str = "#00D4FF"
    purple: str = "#9D4EDD"
    pink: str = "#FF006E"

    def to_css_gradient(self) -&gt; str:
        """Generate CSS gradient string"""
        return f"linear-gradient(135deg, {self.background_deep} 0%, {self.background_mid} 40%, {self.background_light} 100%)"

# Create aurora theme instance
theme = AuroraPalette()
print(f"Background: {theme.to_css_gradient()}")
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfcdf102" class="outline-2">
<h2 id="orgfcdf102"><span class="section-number-2">5.</span> 📊 Data Tables</h2>
<div class="outline-text-2" id="text-5">
<p>
Tables feature aurora gradient headers with smooth hover effects.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Status</th>
<th scope="col" class="org-left">Color</th>
<th scope="col" class="org-left">Animation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Gradient BG</td>
<td class="org-left">✅</td>
<td class="org-left">Aurora flow</td>
<td class="org-left">15s loop</td>
</tr>

<tr>
<td class="org-left">Text Glow</td>
<td class="org-left">✅</td>
<td class="org-left">Purple/Cyan</td>
<td class="org-left">Pulse effect</td>
</tr>

<tr>
<td class="org-left">Code Borders</td>
<td class="org-left">✅</td>
<td class="org-left">Flowing</td>
<td class="org-left">3s animation</td>
</tr>

<tr>
<td class="org-left">Sidebar</td>
<td class="org-left">❌</td>
<td class="org-left">Minimal</td>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">Responsive</td>
<td class="org-left">✅</td>
<td class="org-left">Mobile-first</td>
<td class="org-left">Breakpoints</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org70215f9" class="outline-2">
<h2 id="org70215f9"><span class="section-number-2">6.</span> 🎯 Progress Tracking</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org4e1a069" class="outline-3">
<h3 id="org4e1a069"><span class="section-number-3">6.1.</span> <span class="todo TODO">TODO</span> Aurora Theme Development**</h3>
<div class="outline-text-3" id="text-6-1">
<p>
SCHEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-12-19 Thu&gt;</span></span>
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Create plain theme CSS</li>
<li class="on"><code>[X]</code> Implement gradient backgrounds</li>
<li class="on"><code>[X]</code> Add flowing animations</li>
<li class="off"><code>[&#xa0;]</code> Create sidebar variant</li>
<li class="off"><code>[&#xa0;]</code> Add test documents</li>
<li class="off"><code>[&#xa0;]</code> Write documentation</li>
</ul>
</div>
</div>
<div id="outline-container-orgf9ace2c" class="outline-3">
<h3 id="orgf9ace2c"><span class="section-number-3">6.2.</span> DOING Test accessibility**</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Checking contrast ratios for WCAG AA compliance.
</p>
</div>
</div>
</div>
<div id="outline-container-org1ea65de" class="outline-2">
<h2 id="org1ea65de"><span class="section-number-2">7.</span> 📅 Timeline</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>TODO Review aurora color theory |<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-12-21 Sat&gt;</span></span></li>
<li>TODO Complete plain theme |<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-12-22 Sun&gt;</span></span></li>
<li>DOING Build sidebar theme |<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-12-23 Mon&gt;</span></span></li>
<li>TODO Test all themes |<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-12-24 Tue&gt;</span></span></li>
<li>DONE Initial planning |<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-12-19 Thu&gt;</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-orgf96a572" class="outline-2">
<h2 id="orgf96a572"><span class="section-number-2">8.</span> 📋 Notes</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orga9610f0" class="outline-3">
<h3 id="orga9610f0"><span class="section-number-3">8.1.</span> About the Design**</h3>
<div class="outline-text-3" id="text-8-1">
<p>
The Aurora Plain theme captures the ethereal beauty of northern lights in a digital format. The flowing gradient background creates a sense of movement, while the carefully chosen color palette evokes the mystical aurora borealis.
</p>
</div>
</div>
<div id="outline-container-orgda2539e" class="outline-3">
<h3 id="orgda2539e"><span class="section-number-3">8.2.</span> Key Features **</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>Minimal design without sidebar</li>
<li>Flowing gradient background animation</li>
<li>Aurora-gradient text for headings</li>
<li>Soft glow effects on interactive elements</li>
<li>Responsive layout for all screen sizes</li>
</ul>
</div>
</div>
<div id="outline-container-orgb0deda0" class="outline-3">
<h3 id="orgb0deda0"><span class="section-number-3">8.3.</span> Fonts Used **</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>Headings: Orbitron (futuristic sans-serif)</li>
<li>Body: Exo 2 (tech-inspired readable font)</li>
<li>Code: Fira Code (programmer-friendly monospace)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org29b5583" class="outline-2">
<h2 id="org29b5583"><span class="section-number-2">9.</span> 🔬 Technical Details</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org461a282" class="outline-3">
<h3 id="org461a282"><span class="section-number-3">9.1.</span> CSS Structure **</h3>
<div class="outline-text-3" id="text-9-1">
<p>
The theme uses CSS custom properties (variables) for consistent theming. All colors, spacing, and effects are centralized for easy customization.
</p>
</div>
</div>
<div id="outline-container-orgfd5bd9c" class="outline-3">
<h3 id="orgfd5bd9c"><span class="section-number-3">9.2.</span> Animations **</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>Background gradient flows over 15 seconds</li>
<li>Text gradient animation on H1 (4s infinite)</li>
<li>Line glow animation under title (3s ease-in-out)</li>
<li>TODO task pulse effects (2.5s infinite)</li>
<li>Code block border flow (3s infinite)</li>
</ul>
</div>
</div>
<div id="outline-container-orgbab4a3f" class="outline-3">
<h3 id="orgbab4a3f"><span class="section-number-3">9.3.</span> Performance **</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Animations use GPU-accelerated properties (transform, opacity) where possible. The theme respects `prefers-reduced-motion` for users who prefer less animation.
</p>
</div>
</div>
</div>
<div id="outline-container-org5bdd8f6" class="outline-2">
<h2 id="org5bdd8f6"><span class="section-number-2">10.</span> 📝 Test Footer</h2>
<div class="outline-text-2" id="text-10">
<p>
This theme demonstrates a clean, aurora-inspired aesthetic perfect for documentation, personal notes, or any content that benefits from a futuristic yet elegant design.
</p>

<blockquote>
<p>
"In the realm of code, let the aurora guide your thoughts."
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-12-19 Thu 00:00</p>
<p class="author">Author: Aurora Explorer</p>
<p class="date">Created: 2026-04-09 Thu 21:29</p>
</div>
</body>
</html>
